# ExtractPartAtomFromFamilyFile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ExtractPartAtomFromFamilyFile Method
Application Class See Also
---
Writes a PartAtom XML from the contents of a family file.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ExtractPartAtomFromFamilyFile(
	string familyFilePath,
	string xmlFilePath
)
```

Visual Basic
---
```text
Public Sub ExtractPartAtomFromFamilyFile ( _
	familyFilePath As String, _
	xmlFilePath As String _
)
```

Visual C++
---
```text
public:
void ExtractPartAtomFromFamilyFile(
	String^ familyFilePath,
	String^ xmlFilePath
)
```

# ### Parameters
familyFilePath
    Type: System..::..StringThe family file to be processed.
xmlFilePath
    Type: System..::..StringThe xml file to be saved.
# Remarks
If there is a TXT type catalog next to the family file (a TXT file with the same name as the RFA file), the function will read it as well and process its contents into PartAtom. To extract a PartAtom XML from a family loaded into a document in session, use Family.ExtractPartAtom().
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'familyFilePath' or 'xmlFilePath' is nullNothingnullptra null reference (Nothing in Visual Basic) or an empty string or if the family file doesn't exist on disk. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace